In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
ser1= pd.Series(["linah" , "malak" , "norah"] , index = [1 ,2 ,3 ])
ser1

1    linah
2    malak
3    norah
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
ser1.index = [11,12,13]
ser1

11    linah
12    malak
13    norah
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
ser1[:2]

11    linah
12    malak
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
ser2= pd.Series(["linah" , "malak"] , index = [14 ,15])
print(ser1)
print(ser2)
ser1=ser1.append(ser2) 
ser1

11    linah
12    malak
13    norah
dtype: object
14    linah
15    malak
dtype: object

C:\Users\linah\AppData\Local\Temp\ipykernel_9452\1572825619.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1=ser1.append(ser2)

11    linah
12    malak
13    norah
14    linah
15    malak
dtype: object

In [7]:
 ser1.drop_duplicates()

11    linah
12    malak
13    norah
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [8]:
x={ "ID": [1 , 2] ,
      "Name": ["linah" , "malak"],
      "GPA": [5 , 5] }
Students=pd.DataFrame(x, columns=["ID" , "Name" , "GPA"])   
Students

   ID   Name  GPA
0   1  linah    5
1   2  malak    5

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [9]:
rf = pd.read_csv('educ_figdp_1_Data.csv')
rf

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [10]:
rf.loc[7:21, ['TIME', 'GEO']]

    TIME                            GEO
7   2007  European Union (28 countries)
8   2008  European Union (28 countries)
9   2009  European Union (28 countries)
10  2010  European Union (28 countries)
11  2011  European Union (28 countries)
12  2000  European Union (27 countries)
13  2001  European Union (27 countries)
14  2002  European Union (27 countries)
15  2003  European Union (27 countries)
16  2004  European Union (27 countries)
17  2005  European Union (27 countries)
18  2006  European Union (27 countries)
19  2007  European Union (27 countries)
20  2008  European Union (27 countries)
21  2009  European Union (27 countries)

In [11]:
rf[7:21]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e
20,2008,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e